src/community/app-schema/webservice-test/src/test/resources/test-data/request.ftl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:type="http://xaware.org/xas/ns1/type">
   <soapenv:Header/>
   <soapenv:Body>
      <type:unitdata.units.xbd>
         <type:ID>${unitId}</type:ID>
      </type:unitdata.units.xbd>
   </soapenv:Body>
</soapenv:Envelope>